UsefElbedwehy/STM32F102-drivers/02-MCAL/09-DMA/Src/DMA_prog.c
/***********************************************************************************************************************************
 ***********************************************************************************************************************************
 ***********************************************************************************************************************************
 * @File	:	DMA_prog.c
 * @Author	:	Usef Elbedwehy
 * @Brief	:	Main program body of DMA
 * @layer	:	MCAL
 * @Date	:	11 March 2024
 ***********************************************************************************************************************************
 ***********************************************************************************************************************************
 * How to use the driver:
 * 1) #define CONFIGURATION_STRUCT_ADDRESS    &DMA_ConfigStruct
 *    DMA_Init(CONFIGURATION_STRUCT_ADDRESS)
 *    DMA_Start(CONFIGURATION_STRUCT_ADDRESS , SrcAddress, DestAddress, Size)
 *
 * 2) if you are going to use DMA with interrupt do not forget to set the SCB and NVIC configurations
 * 		DMA_SetCallBack()
 * 		DMA_Init(CONFIGURATION_STRUCT_ADDRESS)
 *    	DMA_Start_IT(CONFIGURATION_STRUCT_ADDRESS , SrcAddress, DestAddress, Size)
 *
 **********************************************************************************************************************************/

/***********************************************************************************************************************************
 ************************************************ ### INCLUDE SECTION ### **********************************************************
 **********************************************************************************************************************************/
#include <stdint.h>

#include "ErrType.h"
#include "Stm32F103xx.h"

#include "DMA_prv.h"
#include "DMA_interface.h"
/***********************************************************************************************************************************/

/************************************************************************************************************************************
 ********************************************* ### GLOBAL VARIABLES SECTION ### *****************************************************
 ************************************************************************************************************************************/
static DMA_regDef_t* DMAx[DMA_NUMBERS] = { DMA1 , DMA2 };

static void (*DMA1_Gpv_CallBack[DMA_MAX_CHANNEL_NUMBER][DMA_CHANNELx_MAX_FLAG_NUMBER]) (void) = {NULL};
static void (*DMA2_Gpv_CallBack[DMA_MAX_CHANNEL_NUMBER][DMA_CHANNELx_MAX_FLAG_NUMBER]) (void) = {NULL};
/************************************************************************************************************************************/

/************************************************************************************************************************************
 ********************************************** ### Functions Declarations ### ******************************************************
 ************************************************************************************************************************************/

/*
 * @fn		: DMA_Init
 * @brief	: Initialize the DMA channel
 * @param	: Init			pointer to const (STRUCT: @DMA_InitConfig_t)
 * @retval	: Local_ErrorState		(ENUM: @ErrorState_t)
 *
 * */
ErrorState_t DMA_Init(const DMA_InitConfig_t* Init)
{
	ErrorState_t Local_ErrorState = DMA_OK;

	if(Init == NULL)
	{
		Local_ErrorState = DMA_NULL_POINTER;
	}

	if(		   (Init->DMA_NUMBER >= DMA_NUM_1)
			&& (Init->DMA_NUMBER <= DMA_NUM_2)
			&& (Init->DMA_CHANNEL_NUMBER >= DMA_CHANNEL_1)
			&& (Init->DMA_CHANNEL_NUMBER <= DMA_CHANNEL_7)
			&& (Init->DMA_PRIORITY >= DMA_PRIORITY_LOW)
			&& (Init->DMA_PRIORITY <= DMA_PRIORITY_VERY_HIGH)
			&& (Init->DMA_DATA_TRANS_DIR >= DMA_DIR_P2P)
			&& (Init->DMA_DATA_TRANS_DIR <= DMA_DIR_M2P)
			&& (Init->DMA_CIRCULAR_MODE >= DMA_CIRCULAR_DISABLED)
			&& (Init->DMA_CIRCULAR_MODE <= DMA_CIRCULARENABLED)
			&& (Init->DMA_PERIPH_SIZE >= DMA_8_BITS_PSIZE)
			&& (Init->DMA_PERIPH_SIZE <= DMA_32_BITS_PSIZE)
			&& (Init->DMA_MEM_SIZE >= DMA_8_BITS_MSIZE)
			&& (Init->DMA_MEM_SIZE <= DMA_32_BITS_MSIZE)
			&& (Init->DMA_PERIPH_INC >= DMA_PINC_DISABLE)
			&& (Init->DMA_PERIPH_INC <= DMA_PINC_ENABLE)
			&& (Init->DMA_MEM_INC >= DMA_MINC_DISABLE)
			&& (Init->DMA_MEM_INC <= DMA_MINC_ENABLE)
			&& (Init->DMA_INT_EN_STATE >= DMA_INTERRUPT_DISABLED)
			&& (Init->DMA_INT_EN_STATE <= DMA_INTERRUPT_ENABLED)
			&& (Init->DMA_INTs_STATE.DMA_INTERRUPT_TCIE >= DMA_INT_TCIE_DISABLED)
			&& (Init->DMA_INTs_STATE.DMA_INTERRUPT_TCIE <= DMA_INT_TCIE_ENABLED)
			&& (Init->DMA_INTs_STATE.DMA_INTERRUPT_THIE >= DMA_INT_THIE_DISABLED)
			&& (Init->DMA_INTs_STATE.DMA_INTERRUPT_THIE <= DMA_INT_THIE_ENABLED)
			&& (Init->DMA_INTs_STATE.DMA_INTERRUPT_TEIE >= DMA_INT_TEIE_DISABLED)
			&& (Init->DMA_INTs_STATE.DMA_INTERRUPT_TEIE <= DMA_INT_TEIE_ENABLED))
	{
		/*SET PRIORITY*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (Init->DMA_PRIORITY << DMA_CCRx_PL__);

		/* --- SET DATA TRANSFER DIRECTION --- */
		DMA_SetDataTransferDirection(Init);

		/*CIRCULAR MODE ENABLE/DISABLE*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (Init->DMA_CIRCULAR_MODE << DMA_CCRx_CIRC);

		/*PERIPHERAL SIZE*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (Init->DMA_PERIPH_SIZE << DMA_CCRx_PSIZE__);

		/*MEMORY SIZE*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (Init->DMA_MEM_SIZE << DMA_CCRx_MSIZE__);

		/*PERIPHERAL INCREMENT ENABLE/DISABLE*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (Init->DMA_PERIPH_INC << DMA_CCRx_PINC);

		/*MEMORY INCREMENT ENABLE/DISABLE*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (Init->DMA_MEM_INC << DMA_CCRx_MINC);

