UsefElbedwehy/STM32F102-drivers/02-MCAL/09-DMA/Src/DMA_prog.c
	}
	else
	{
		Local_ErrorState = DMA_NOK;
	}

	return Local_ErrorState;
}

/*
 * @fn		: DMA_Start
 * @brief	: DMA start transfer
 * @param	: Init			pointer to const (STRUCT: @DMA_InitConfig_t)
 * @param	: Copy_u32Src			(uint32_t)
 * @param	: Copy_u32Dst			(uint32_t)
 * @param	: Copy_u32Size			(uint32_t)
 * @retval	: Local_ErrorState		(ENUM: @ErrorState_t)
 *
 * */
ErrorState_t DMA_Start(const DMA_InitConfig_t* Init,uint32_t Copy_u32Src, uint32_t Copy_u32Dst, uint32_t Copy_u32Size)
{
	ErrorState_t Local_ErrorState = DMA_OK;

	if((Init != NULL))
	{
		/*DISABLE CHANNEL*/
		DMA_DisableChannel(Init);
		/*Configure the source and destination*/
		switch(Init->DMA_DATA_TRANS_DIR)
		{
		case DMA_DIR_M2M:
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CMAR = Copy_u32Src;
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CPAR = Copy_u32Dst;
			break;
		case DMA_DIR_M2P:
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CMAR = Copy_u32Src;
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CPAR = Copy_u32Dst;
			break;
		case DMA_DIR_P2M:
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CPAR = Copy_u32Src;
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CMAR = Copy_u32Dst;
			break;
		case DMA_DIR_P2P:
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CPAR = Copy_u32Src;
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CMAR = Copy_u32Dst;
			break;
		}
		/*transfer size*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CNDTR = Copy_u32Size;

		/*ENABLE CHANNEL*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (DMA_SET_MASK << DMA_CCRx_EN);
	}
	else
	{
		Local_ErrorState = DMA_NULL_POINTER;
	}

	return Local_ErrorState;
}

/*
 * @fn		: DMA_Start_IT
 * @brief	: DMA start transfer with interrupt notification
 * @param	: Init			pointer to const (STRUCT: @DMA_InitConfig_t)
 * @param	: Copy_u32Src			(uint32_t)
 * @param	: Copy_u32Dst			(uint32_t)
 * @param	: Copy_u32Size			(uint32_t)
 * @retval	: Local_ErrorState		(ENUM: @ErrorState_t)
 *
 * */
ErrorState_t DMA_Start_IT(const DMA_InitConfig_t* Init,uint32_t Copy_u32Src, uint32_t Copy_u32Dst, uint32_t Copy_u32Size)
{
	ErrorState_t Local_ErrorState = DMA_OK;

	if((Init != NULL))
	{
		/*DISABLE CHANNEL*/
		DMA_DisableChannel(Init);
		/*Configure the source and destination*/
		switch(Init->DMA_DATA_TRANS_DIR)
		{
		case DMA_DIR_M2M:
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CMAR = Copy_u32Src;
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CPAR = Copy_u32Dst;
			break;
		case DMA_DIR_M2P:
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CPAR = Copy_u32Dst;
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CMAR = Copy_u32Src;

			break;
		case DMA_DIR_P2M:
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CPAR = Copy_u32Src;
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CMAR = Copy_u32Dst;
			break;
		case DMA_DIR_P2P:
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CPAR = Copy_u32Src;
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CMAR = Copy_u32Dst;
			break;
		}

		/*transfer size*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CNDTR = Copy_u32Size;
		/*Clear all interrupts flag*/
		DMA_ClearInterruptFlags(Init->DMA_NUMBER , Init->DMA_CHANNEL_NUMBER);
		/*Enable Configured interrupts*/
		DMA_InterruptEnable(Init);
		/*ENABLE CHANNEL*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (DMA_SET_MASK << DMA_CCRx_EN);

	}
	else
	{
		Local_ErrorState = DMA_NULL_POINTER;
	}


	return Local_ErrorState;
}
/*------------------------------------------------------------------------------------------*/
/*
 * @fn		: DMA_EnableChannel
 * @brief	: Enable DMA channel
 * @param	: Init			const pointer to (STRUCT: @DMA_InitConfig_t)
 * @retval  : void
 *
 * */
void DMA_EnableChannel(const DMA_InitConfig_t* Init)
{
	DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (DMA_SET_MASK << DMA_CCRx_EN);
}

/*
 * @fn		: DMA_DisableChannel
 * @brief	: Disable DMA channel
 * @param	: Init			const pointer to (STRUCT: @DMA_InitConfig_t)
 * @retval  : void
 *
 * */
void DMA_DisableChannel(const DMA_InitConfig_t* Init)
{
	DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR &=~ (DMA_SET_MASK << DMA_CCRx_EN);
}

/*
 * @fn      : DMA_SetSrcDestSize
 * @brief   : to set the source ,destination and size of data
 * @param	: Init			pointer to const (STRUCT: @DMA_InitConfig_t)
 * @param	: Copy_u32Src			(uint32_t)
 * @param	: Copy_u32Dst			(uint32_t)
 * @param	: Copy_u32Size			(uint32_t)
 * @retval	: Local_ErrorState		(ENUM: @ErrorState_t)
 *
 * */
ErrorState_t DMA_SetSrcDestSize(const DMA_InitConfig_t* Init,uint32_t Copy_u32Src, uint32_t Copy_u32Dst, uint32_t Copy_u32Size)
{
	ErrorState_t Local_ErrorState = DMA_OK;

	if((Init != NULL) )
	{
		/*Configure the source and destination*/
		switch(Init->DMA_DATA_TRANS_DIR)
		{
		case DMA_DIR_M2M:
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CMAR = Copy_u32Src;
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CPAR = Copy_u32Dst;
			break;
		case DMA_DIR_M2P:
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CMAR = Copy_u32Src;
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CPAR = Copy_u32Dst;
			break;
		case DMA_DIR_P2M:
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CPAR = Copy_u32Src;
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CMAR = Copy_u32Dst;
			break;
		case DMA_DIR_P2P:
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CPAR = Copy_u32Src;
			DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CMAR = Copy_u32Dst;
			break;
		}
		/*transfer size*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CNDTR = Copy_u32Size;

