UsefElbedwehy/STM32F102-drivers/02-MCAL/09-DMA/Src/DMA_prog.c
	}
	else
	{
		Local_ErrorState = DMA_NULL_POINTER;
	}

	return Local_ErrorState;
}

/*
 *@fn		: DMA_SetCallBack
 *@brief	: Set the call back function
 *@param	: DMA_Number		(ENUM: @DMA_Number_t)
 *@param	: Channel_Number	(ENUM: @DMA_Channel_t)
 *@param	: FlagID			(ENUM: @DMA_FlagID_t)
 *@param	: pv_CallBack		pointer to void function
 *@retval	: Local_ErrorState  (ENUM: @ErrorState_t)
 *
 * */
ErrorState_t DMA_SetCallBack(DMA_Number_t  DMA_Number ,DMA_Channel_t Channel_Number ,DMA_FlagID_t FlagID ,void (*pv_CallBack)(void))
{
	ErrorState_t Local_ErrorState = DMA_OK;

	if(pv_CallBack == NULL)
	{
		Local_ErrorState = DMA_NULL_POINTER;
	}
	else
	{
		switch(DMA_Number)
		{
		case DMA_NUM_1:
			DMA1_Gpv_CallBack[Channel_Number][DMA_CHANNELx_TRANSFER_COMPLETE_FLAG] = pv_CallBack ;
			break;
		case DMA_NUM_2:
			DMA2_Gpv_CallBack[Channel_Number][DMA_CHANNELx_TRANSFER_COMPLETE_FLAG] = pv_CallBack ;
			break;
		}
	}

	return Local_ErrorState;
}

/*
 *@fn		: DMA_IRQ_Handler
 *@brief	: Set the call back function
 *@param	: DMA_Number		(ENUM: @DMA_Number_t)
 *@param	: Channel_Number			(ENUM: @DMA_Channel_t)
 *@retval	: void
 *
 * */
void DMA_IRQ_Handler(DMA_Number_t  DMA_Number ,DMA_Channel_t Channel_Number)
{
	if(DMA_Number == DMA_NUM_1)
	{
		/* ----- DMA1 ----- */
		/*GLOBAL INTERRUPT FLAG*/
		if(DMA_GetInterruptFlags(DMA_NUM_1 , Channel_Number , DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG) == DMA_READY_FLAG)
		{

			if( (DMA1_Gpv_CallBack[Channel_Number][DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG] != NULL))
			{
				DMA1_Gpv_CallBack[Channel_Number][DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG]();
			}

		}
		/*TRANSFER COMPLETE FLAG*/
		if(DMA_GetInterruptFlags(DMA_NUM_1 , Channel_Number , DMA_CHANNELx_TRANSFER_COMPLETE_FLAG) == DMA_READY_FLAG)
		{

			if((DMA1_Gpv_CallBack[Channel_Number][DMA_CHANNELx_TRANSFER_COMPLETE_FLAG] != NULL))
			{
				DMA1_Gpv_CallBack[Channel_Number][DMA_CHANNELx_TRANSFER_COMPLETE_FLAG]();
			}

		}
		/*HALF TRANSFER FLAG*/
		if(DMA_GetInterruptFlags(DMA_NUM_1 , Channel_Number , DMA_CHANNELx_HALF_TRANSFER_FLAG) == DMA_READY_FLAG)
		{

			if((DMA1_Gpv_CallBack[Channel_Number][DMA_CHANNELx_HALF_TRANSFER_FLAG] != NULL))
			{
				DMA1_Gpv_CallBack[Channel_Number][DMA_CHANNELx_HALF_TRANSFER_FLAG]();
			}

		}
		/*TRANSFER ERROR FLAG*/
		if(DMA_GetInterruptFlags(DMA_NUM_1 , Channel_Number , DMA_CHANNELx_TRANSFER_ERROR_FLAG) == DMA_READY_FLAG)
		{

			if((DMA1_Gpv_CallBack[Channel_Number][DMA_CHANNELx_TRANSFER_ERROR_FLAG] != NULL))
			{
				DMA1_Gpv_CallBack[Channel_Number][DMA_CHANNELx_TRANSFER_ERROR_FLAG]();
			}

		}
		DMA_ClearInterruptFlag(DMA_NUM_1, Channel_Number, DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG);
	}
	else if(DMA_Number == DMA_NUM_2)
	{
		/* ----- DMA2 ----- */
		if(Channel_Number < DMA_CHANNEL_4)
		{
			/*GLOBAL INTERRUPT FLAG*/
			if(DMA_GetInterruptFlags(DMA_NUM_2 , Channel_Number , DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG) == DMA_READY_FLAG)
			{

				if( (DMA2_Gpv_CallBack[Channel_Number][DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG] != NULL))
				{
					DMA2_Gpv_CallBack[Channel_Number][DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG]();
				}

			}
			/*TRANSFER COMPLETE FLAG*/
			if(DMA_GetInterruptFlags(DMA_NUM_2 , Channel_Number , DMA_CHANNELx_TRANSFER_COMPLETE_FLAG) == DMA_READY_FLAG)
			{
				//DMA_ClearInterruptFlag(DMA_NUM_2, Channel_Number, DMA_CHANNELx_TRANSFER_COMPLETE_FLAG);
				if((DMA2_Gpv_CallBack[Channel_Number][DMA_CHANNELx_TRANSFER_COMPLETE_FLAG] != NULL))
				{
					DMA2_Gpv_CallBack[Channel_Number][DMA_CHANNELx_TRANSFER_COMPLETE_FLAG]();
				}

			}
			/*HALF TRANSFER FLAG*/
			if(DMA_GetInterruptFlags(DMA_NUM_2 , Channel_Number , DMA_CHANNELx_HALF_TRANSFER_FLAG) == DMA_READY_FLAG)
			{
				//DMA_ClearInterruptFlag(DMA_NUM_2, Channel_Number, DMA_CHANNELx_HALF_TRANSFER_FLAG);
				if((DMA2_Gpv_CallBack[Channel_Number][DMA_CHANNELx_HALF_TRANSFER_FLAG] != NULL))
				{
					DMA2_Gpv_CallBack[Channel_Number][DMA_CHANNELx_HALF_TRANSFER_FLAG]();
				}

			}
			/*TRANSFER ERROR FLAG*/
			if(DMA_GetInterruptFlags(DMA_NUM_2 , Channel_Number , DMA_CHANNELx_TRANSFER_ERROR_FLAG) == DMA_READY_FLAG)
			{
				//DMA_ClearInterruptFlag(DMA_NUM_2, Channel_Number, DMA_CHANNELx_TRANSFER_ERROR_FLAG);
				if((DMA2_Gpv_CallBack[Channel_Number][DMA_CHANNELx_TRANSFER_ERROR_FLAG] != NULL))
				{
					DMA2_Gpv_CallBack[Channel_Number][DMA_CHANNELx_TRANSFER_ERROR_FLAG]();
				}

			}
			DMA_ClearInterruptFlag(DMA_NUM_2, Channel_Number, DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG);
		}
		else if(Channel_Number == DMA_CHANNEL_4)
		{
			/*---------- CHANNEL_4 -------------*/
			/*GLOBAL INTERRUPT FLAG*/
			if(DMA_GetInterruptFlags(DMA_NUM_2 , DMA_CHANNEL_4 , DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG) == DMA_READY_FLAG)
			{
				//DMA_ClearInterruptFlag(DMA_NUM_2, DMA_CHANNEL_4, DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG);
				if( (DMA2_Gpv_CallBack[DMA_CHANNEL_4][DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG] != NULL))
				{
					DMA2_Gpv_CallBack[DMA_CHANNEL_4][DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG]();
				}

			}
			/*TRANSFER COMPLETE FLAG*/
			if(DMA_GetInterruptFlags(DMA_NUM_2 , DMA_CHANNEL_4 , DMA_CHANNELx_TRANSFER_COMPLETE_FLAG) == DMA_READY_FLAG)
			{
				//DMA_ClearInterruptFlag(DMA_NUM_2, DMA_CHANNEL_4, DMA_CHANNELx_TRANSFER_COMPLETE_FLAG);
				if((DMA2_Gpv_CallBack[DMA_CHANNEL_4][DMA_CHANNELx_TRANSFER_COMPLETE_FLAG] != NULL))
				{
					DMA2_Gpv_CallBack[DMA_CHANNEL_4][DMA_CHANNELx_TRANSFER_COMPLETE_FLAG]();
				}

			}
			/*HALF TRANSFER FLAG*/
			if(DMA_GetInterruptFlags(DMA_NUM_2 , DMA_CHANNEL_4 , DMA_CHANNELx_HALF_TRANSFER_FLAG) == DMA_READY_FLAG)
			{
				//DMA_ClearInterruptFlag(DMA_NUM_2, DMA_CHANNEL_4, DMA_CHANNELx_HALF_TRANSFER_FLAG);
				if((DMA2_Gpv_CallBack[DMA_CHANNEL_4][DMA_CHANNELx_HALF_TRANSFER_FLAG] != NULL))
				{
					DMA2_Gpv_CallBack[DMA_CHANNEL_4][DMA_CHANNELx_HALF_TRANSFER_FLAG]();
				}

			}
			/*TRANSFER ERROR FLAG*/
			if(DMA_GetInterruptFlags(DMA_NUM_2 , DMA_CHANNEL_4 , DMA_CHANNELx_TRANSFER_ERROR_FLAG) == DMA_READY_FLAG)
			{
				//DMA_ClearInterruptFlag(DMA_NUM_2, DMA_CHANNEL_4, DMA_CHANNELx_TRANSFER_ERROR_FLAG);
				if((DMA2_Gpv_CallBack[DMA_CHANNEL_4][DMA_CHANNELx_TRANSFER_ERROR_FLAG] != NULL))
				{
					DMA2_Gpv_CallBack[DMA_CHANNEL_4][DMA_CHANNELx_TRANSFER_ERROR_FLAG]();
				}

