UsefElbedwehy/STM32F102-drivers/02-MCAL/09-DMA/Src/DMA_prog.c
			}
			/*---------- CHANNEL_5 -------------*/
			/*GLOBAL INTERRUPT FLAG*/
			if(DMA_GetInterruptFlags(DMA_NUM_2 , DMA_CHANNEL_5 , DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG) == DMA_READY_FLAG)
			{
				//DMA_ClearInterruptFlag(DMA_NUM_2, DMA_CHANNEL_5, DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG);
				if( (DMA2_Gpv_CallBack[DMA_CHANNEL_5][DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG] != NULL))
				{
					DMA2_Gpv_CallBack[DMA_CHANNEL_5][DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG]();
				}

			}
			/*TRANSFER COMPLETE FLAG*/
			if(DMA_GetInterruptFlags(DMA_NUM_2 , DMA_CHANNEL_5 , DMA_CHANNELx_TRANSFER_COMPLETE_FLAG) == DMA_READY_FLAG)
			{
				//DMA_ClearInterruptFlag(DMA_NUM_2, DMA_CHANNEL_5, DMA_CHANNELx_TRANSFER_COMPLETE_FLAG);
				if((DMA2_Gpv_CallBack[DMA_CHANNEL_5][DMA_CHANNELx_TRANSFER_COMPLETE_FLAG] != NULL))
				{
					DMA2_Gpv_CallBack[DMA_CHANNEL_5][DMA_CHANNELx_TRANSFER_COMPLETE_FLAG]();
				}

			}
			/*HALF TRANSFER FLAG*/
			if(DMA_GetInterruptFlags(DMA_NUM_2 , DMA_CHANNEL_5 , DMA_CHANNELx_HALF_TRANSFER_FLAG) == DMA_READY_FLAG)
			{
				//DMA_ClearInterruptFlag(DMA_NUM_2, DMA_CHANNEL_5, DMA_CHANNELx_HALF_TRANSFER_FLAG);
				if((DMA2_Gpv_CallBack[DMA_CHANNEL_5][DMA_CHANNELx_HALF_TRANSFER_FLAG] != NULL))
				{
					DMA2_Gpv_CallBack[DMA_CHANNEL_5][DMA_CHANNELx_HALF_TRANSFER_FLAG]();
				}

			}
			/*TRANSFER ERROR FLAG*/
			if(DMA_GetInterruptFlags(DMA_NUM_2 , DMA_CHANNEL_5 , DMA_CHANNELx_TRANSFER_ERROR_FLAG) == DMA_READY_FLAG)
			{
				//DMA_ClearInterruptFlag(DMA_NUM_2, DMA_CHANNEL_5, DMA_CHANNELx_TRANSFER_ERROR_FLAG);
				if((DMA2_Gpv_CallBack[DMA_CHANNEL_5][DMA_CHANNELx_TRANSFER_ERROR_FLAG] != NULL))
				{
					DMA2_Gpv_CallBack[DMA_CHANNEL_5][DMA_CHANNELx_TRANSFER_ERROR_FLAG]();
				}

			}
			DMA_ClearInterruptFlag(DMA_NUM_2, DMA_CHANNEL_4, DMA_CHANNELx_TRANSFER_COMPLETE_FLAG);
			DMA_ClearInterruptFlag(DMA_NUM_2, DMA_CHANNEL_5, DMA_CHANNELx_TRANSFER_COMPLETE_FLAG);
		}

	}


}
/*------------------------------------------------------------------------------------------------------------------------------------
 * ------------------------------------------------------- File Functions ------------------------------------------------------------
 * ----------------------------------------------------------------------------------------------------------------------------------*/
/*
 *@fn		: DMA_InterruptEnable
 *@brief	: to set the interrupts status (enable/disable)
 *@param	: Init			constant pointer to struct (@DMA_InitConfig_t)
 *@retval	: void
 *
 * */
void DMA_InterruptEnable(const DMA_InitConfig_t* Init)
{
	/*Transfer complete interrupt enable/disable*/
	DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR &=~ (DMA_SET_MASK << DMA_CCRx_TCIE);
	DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (Init->DMA_INTs_STATE.DMA_INTERRUPT_TCIE << DMA_CCRx_TCIE);
	/*Half transfer interrupt enable/disable*/
	DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR &=~ (DMA_SET_MASK << DMA_CCRx_HTIE);
	DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (Init->DMA_INTs_STATE.DMA_INTERRUPT_THIE << DMA_CCRx_HTIE);
	/*Transfer error interrupt enable/disable*/
	DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR &=~ (DMA_SET_MASK << DMA_CCRx_TEIE);
	DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (Init->DMA_INTs_STATE.DMA_INTERRUPT_TEIE << DMA_CCRx_TEIE);

}

/*
 *@fn		: DMA_ClearInterruptFlags
 *@brief	: to clear the interrupts flags
 *@param	: DMA_Number			(ENUM:@DMA_Number_t )
 *@param	: Channel_Number		(ENUM:@DMA_Channel_t )
 *@retval	: void
 *
 * */
void DMA_ClearInterruptFlags(DMA_Number_t  DMA_Number ,DMA_Channel_t Channel_Number)
{
	/*Channel x global interrupt clear*/
	DMAx[DMA_Number]->DMA_IFCR |= (DMA_SET_MASK << (DMA_IFCR_CGIF1 + (4 * Channel_Number)) );
	/*Transfer complete interrupt enable/disable*/
	DMAx[DMA_Number]->DMA_IFCR |= (DMA_SET_MASK << (DMA_IFCR_CTCIF1 + (4 * Channel_Number)) );
	/*Half transfer interrupt enable/disable*/
	DMAx[DMA_Number]->DMA_IFCR |= (DMA_SET_MASK << (DMA_IFCR_CHTIF1 + (4 * Channel_Number)) );
	/*Transfer error interrupt enable/disable*/
	DMAx[DMA_Number]->DMA_IFCR |= (DMA_SET_MASK << (DMA_IFCR_CTEIF1 + (4 * Channel_Number)) );

}

/*
 *@fn		: DMA_ClearInterruptFlags
 *@brief	: to clear the interrupts flags
 *@param	: DMA_Number			(ENUM:@DMA_Number_t )
 *@param	: Channel_Number		(ENUM:@DMA_Channel_t )
 *@param	: Copy_FlagID			(ENUM:@DMA_FlagID_t )
 *@retval	: void
 *
 * */
void DMA_ClearInterruptFlag(DMA_Number_t  DMA_Number ,DMA_Channel_t Channel_Number ,DMA_FlagID_t Copy_FlagID)
{
	switch(Copy_FlagID)
	{
	case DMA_CHANNELx_GLOBAL_INTERRUPT_FLAG:
		/*Channel x global interrupt clear*/
		DMAx[DMA_Number]->DMA_IFCR |= (DMA_SET_MASK << (DMA_IFCR_CGIF1 + (4 * Channel_Number)) );
		break;
	case DMA_CHANNELx_TRANSFER_COMPLETE_FLAG:
		/*Transfer complete interrupt enable/disable*/
		DMAx[DMA_Number]->DMA_IFCR |= (DMA_SET_MASK << (DMA_IFCR_CTCIF1 + (4 * Channel_Number)) );
		break;
	case DMA_CHANNELx_HALF_TRANSFER_FLAG:
		/*Half transfer interrupt enable/disable*/
		DMAx[DMA_Number]->DMA_IFCR |= (DMA_SET_MASK << (DMA_IFCR_CHTIF1 + (4 * Channel_Number)) );
		break;
	case DMA_CHANNELx_TRANSFER_ERROR_FLAG:
		/*Transfer error interrupt enable/disable*/
		DMAx[DMA_Number]->DMA_IFCR |= (DMA_SET_MASK << (DMA_IFCR_CTEIF1 + (4 * Channel_Number)) );
		break;
	case DMA_CHANNELx_MAX_FLAG_NUMBER:

		break;
	}

}

/*
 *@fn		: DMA_ClearInterruptFlags
 *@brief	: to clear the interrupts flags
 *@param	: DMA_Number			(ENUM:@DMA_Number_t )
 *@param	: Channel_Number		(ENUM:@DMA_Channel_t )
 *@param	: Copy_FlagID			(ENUM:@DMA_FlagID_t )
 *@retval	: uint8_t
 *
 * */
uint8_t DMA_GetInterruptFlags(DMA_Number_t  DMA_Number ,DMA_Channel_t Channel_Number, DMA_FlagID_t Copy_FlagID)
{
	/*Channel x global interrupt clear*/
	return ((DMAx[DMA_Number]->DMA_ISR >> (Copy_FlagID + (4 * Channel_Number))) & DMA_GET_MASK);
}

/*
 *@fn		: DMA_SetDataTransferDirection
 *@brief	: to set the data transfer direction ( M2M , M2P , P2P ,or M2P)
 *@param	: Init			constant pointer to struct (@DMA_InitConfig_t)
 *@retval	: void
 *
 * */
void DMA_SetDataTransferDirection(const DMA_InitConfig_t* Init)
{
	switch(Init->DMA_DATA_TRANS_DIR)
	{
	case DMA_DIR_P2P:
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR &=~ (DMA_SET_MASK << DMA_CCRx_MEM2MEM);
		/*Read from peripheral*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR &=~ (DMA_SET_MASK << DMA_CCRx_DIR);
		break;
	case DMA_DIR_P2M:
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR &=~ (DMA_SET_MASK << DMA_CCRx_MEM2MEM);
		/*Read from peripheral*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR &=~ (DMA_SET_MASK << DMA_CCRx_DIR);
		break;
	case DMA_DIR_M2M:
		/*MEMORY TO MEMORY MODE ON*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (DMA_SET_MASK << DMA_CCRx_MEM2MEM);
		/*Read from memory*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (DMA_SET_MASK << DMA_CCRx_DIR);
		break;
	case DMA_DIR_M2P:
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR &=~ (DMA_SET_MASK << DMA_CCRx_MEM2MEM);
		/*Read from memory*/
		DMAx[Init->DMA_NUMBER]->DMA_ChannelReg[Init->DMA_CHANNEL_NUMBER].DMA_CCR |= (DMA_SET_MASK << DMA_CCRx_DIR);
		break;
	}
}
/* ----------------------------------------------------------------------------------------------------------------------------------*/
/*************************************************************************************************************************************/

/*************************************************************************************************************************************
 ************************************************ ### HANDLER SECTION ### ***********************************************************
 ************************************************************************************************************************************/
/* -------- DMA1 --------- */
/*DMA1 CHANNNEL1 IRQ HANDLER*/
void DMA1_Channel1_IRQHandler(void)
{
	DMA_IRQ_Handler(DMA_NUM_1 , DMA_CHANNEL_1);
}
/*DMA1 CHANNNEL2 IRQ HANDLER*/
void DMA1_Channel2_IRQHandler(void)
{
	DMA_IRQ_Handler(DMA_NUM_1 , DMA_CHANNEL_2);
}
/*DMA1 CHANNNEL3 IRQ HANDLER*/
void DMA1_Channel3_IRQHandler(void)
{
	DMA_IRQ_Handler(DMA_NUM_1 , DMA_CHANNEL_3);
}
/*DMA1 CHANNNEL4 IRQ HANDLER*/
void DMA1_Channel4_IRQHandler(void)
{
	DMA_IRQ_Handler(DMA_NUM_1 , DMA_CHANNEL_4);
}
/*DMA1 CHANNNEL5 IRQ HANDLER*/
void DMA1_Channel5_IRQHandler(void)
{
	DMA_IRQ_Handler(DMA_NUM_1 , DMA_CHANNEL_5);
}
/*DMA1 CHANNNEL6 IRQ HANDLER*/
void DMA1_Channel6_IRQHandler(void)
{
	DMA_IRQ_Handler(DMA_NUM_1 , DMA_CHANNEL_6);
}
/*DMA1 CHANNNEL7 IRQ HANDLER*/
void DMA1_Channel7_IRQHandler(void)
{
	DMA_IRQ_Handler(DMA_NUM_1 , DMA_CHANNEL_7);
}
/* -------- DMA2 --------- */
/*DMA2 CHANNNEL1 IRQ HANDLER*/
void DMA2_Channel1_IRQHandler(void)
{
	DMA_IRQ_Handler(DMA_NUM_2 , DMA_CHANNEL_1);
}
/*DMA2 CHANNNEL2 IRQ HANDLER*/
void DMA2_Channel2_IRQHandler(void)
{
	DMA_IRQ_Handler(DMA_NUM_2 , DMA_CHANNEL_2);
}
/*DMA2 CHANNNEL3 IRQ HANDLER*/
void DMA2_Channel3_IRQHandler(void)
{
	DMA_IRQ_Handler(DMA_NUM_2 , DMA_CHANNEL_3);
}
/*DMA2 CHANNNEL4 and CHANNNEL5 IRQ HANDLER*/
void DMA2_Channel4_5_IRQHandler(void)
{
	DMA_IRQ_Handler(DMA_NUM_2 , DMA_CHANNEL_4);
}
/************************************************************************************************************************************/

